app/views/artists/destroy.js.erb

$('.delete-artist').bind('ajax:success', function() {
   $(this).closest('tr').fadeOut();
});
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 3]]