app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE (title LIKE '%dung%')
---
  def index
    find_album_favorites
    @albums = Album.search(params[:search])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def new
    @album = Album.new
    @artist = Artist.find(params[:artist])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @artist = Artist.find(params[:artist])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "user_id", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "bloop"], ["user_id", 2], ["artist_id", 4], ["created_at", 2017-01-31 18:55:12 UTC], ["updated_at", 2017-01-31 18:55:12 UTC]]
---
  def create
    @artist = Artist.find(params[:artist_id])
    @album = Album.new(user_id: params[:user_id], artist_id: params[:artist_id], title: params[:album][:title])

    respond_to do |format|
      if @album.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."favoriteable_id" = $1 AND "favorites"."favoriteable_type" = $2 AND "favorites"."user_id" = 1 ORDER BY "favorites"."id" ASC LIMIT $3  [["favoriteable_id", 1], ["favoriteable_type", "Album"], ["LIMIT", 1]]
---
    def find_album_favorites
      @favorites = Favorite.where(user_id: current_user.id, favoriteable_type: "Album")

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_album
      @album = Album.find(params[:id])