app/controllers/artists_controller.rb

  def index
    find_artist_favorites
    @artists = Artist.all
---
SELECT "artists".* FROM "artists" WHERE (name LIKE '%mooky%')

  def create
    @artist = Artist.new(user_id: params[:user_id], name: params[:artist][:name] )

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "merlerky"], ["user_id", 1], ["created_at", 2017-01-31 23:08:53 UTC], ["updated_at", 2017-01-31 23:08:53 UTC]]

  def update
    respond_to do |format|
      if @artist.update(user_id: params[:user_id], name: params[:artist][:name] )
---
UPDATE "artists" SET "name" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["name", "mookys"], ["updated_at", 2017-02-01 19:47:49 UTC], ["id", 2]]

  def destroy
    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 3]]

    def find_artist_favorites
      @favorites = Favorite.where(user_id: current_user.id, favoriteable_type: "Artist")
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."favoriteable_id" = $1 AND "favorites"."favoriteable_type" = $2 AND "favorites"."user_id" = 1 ORDER BY "favorites"."id" ASC LIMIT $3  [["favoriteable_id", 1], ["favoriteable_type", "Artist"], ["LIMIT", 1]]

    def set_artist
      @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]