app/controllers/favorites_controller.rb

	def create
		case params[:media_type]
			when "Artist"
				media = Artist.find(params[:media_id])
			when "Album"
				media = Album.find(params[:media_id])
			when "Song"
				media = Song.find(params[:media_id])
		end
		media.favorites.create(user_id: current_user)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "favoriteable_type", "favoriteable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["favoriteable_type", "Artist"], ["favoriteable_id", 1], ["created_at", 2017-01-31 21:21:32 UTC], ["updated_at", 2017-01-31 21:21:32 UTC]]

	def destroy
		Favorite.find(params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 2]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]