app/controllers/songs_controller.rb

  def index
    find_song_favorites
    @songs = Song.search(params[:search])
---
SELECT "songs".* FROM "songs" WHERE (title LIKE '%fds%')

  def new
    @song = Song.new
    @album = Album.find(params[:album])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def edit
    @album = Album.find(params[:album])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @album = Album.find(params[:album_id])
    @song = Song.new(user_id: params[:user_id], album_id: params[:album_id], title: params[:song][:title])

    respond_to do |format|
      if @song.save
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "songs" ("title", "user_id", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "scruffy"], ["user_id", 2], ["album_id", 4], ["created_at", 2017-01-31 19:10:27 UTC], ["updated_at", 2017-01-31 19:10:27 UTC]]

  def update
    respond_to do |format|
      if @song.update(user_id: params[:user_id], album_id: params[:album_id], title: params[:song][:title])
---
UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "scruffys"], ["updated_at", 2017-01-31 19:10:38 UTC], ["id", 7]]

    def find_song_favorites
      @favorites = Favorite.where(user_id: current_user.id, favoriteable_type: "Song")
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."favoriteable_id" = $1 AND "favorites"."favoriteable_type" = $2 AND "favorites"."user_id" = 1 ORDER BY "favorites"."id" ASC LIMIT $3  [["favoriteable_id", 1], ["favoriteable_type", "Song"], ["LIMIT", 1]]