app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    if !params[:id]
      @user = current_user
    else
      @user = User.find(params[:id])

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."favoriteable_type" = $2 ORDER BY "favorites"."id" ASC LIMIT $3  [["user_id", 1], ["favoriteable_type", "Artist"], ["LIMIT", 1]]
---
    def find_song_favorites
      Favorite.where(user_id: current_user.id, favoriteable_type: "Song")